// Generated by jextract

package com.icuxika.jextract.libffmpeg;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
/**
 * {@snippet :
 * struct AVFormatContext {
 *     const AVClass* av_class;
 *     struct AVInputFormat* iformat;
 *     struct AVOutputFormat* oformat;
 *     void* priv_data;
 *     AVIOContext* pb;
 *     int ctx_flags;
 *     unsigned int nb_streams;
 *     AVStream** streams;
 *     char* url;
 *     int64_t start_time;
 *     int64_t duration;
 *     int64_t bit_rate;
 *     unsigned int packet_size;
 *     int max_delay;
 *     int flags;
 *     int64_t probesize;
 *     int64_t max_analyze_duration;
 *     const uint8_t* key;
 *     int keylen;
 *     unsigned int nb_programs;
 *     AVProgram** programs;
 *     enum AVCodecID video_codec_id;
 *     enum AVCodecID audio_codec_id;
 *     enum AVCodecID subtitle_codec_id;
 *     unsigned int max_index_size;
 *     unsigned int max_picture_buffer;
 *     unsigned int nb_chapters;
 *     AVChapter** chapters;
 *     AVDictionary* metadata;
 *     int64_t start_time_realtime;
 *     int fps_probe_size;
 *     int error_recognition;
 *     AVIOInterruptCB interrupt_callback;
 *     int debug;
 *     int64_t max_interleave_delta;
 *     int strict_std_compliance;
 *     int event_flags;
 *     int max_ts_probe;
 *     int avoid_negative_ts;
 *     int ts_id;
 *     int audio_preload;
 *     int max_chunk_duration;
 *     int max_chunk_size;
 *     int use_wallclock_as_timestamps;
 *     int avio_flags;
 *     enum AVDurationEstimationMethod duration_estimation_method;
 *     int64_t skip_initial_bytes;
 *     unsigned int correct_ts_overflow;
 *     int seek2any;
 *     int flush_packets;
 *     int probe_score;
 *     int format_probesize;
 *     char* codec_whitelist;
 *     char* format_whitelist;
 *     int io_repositioned;
 *     const AVCodec* video_codec;
 *     const AVCodec* audio_codec;
 *     const AVCodec* subtitle_codec;
 *     const AVCodec* data_codec;
 *     int metadata_header_padding;
 *     void* opaque;
 *     av_format_control_message control_message_cb;
 *     int64_t output_ts_offset;
 *     uint8_t* dump_separator;
 *     enum AVCodecID data_codec_id;
 *     char* protocol_whitelist;
 *     int (*io_open)(struct AVFormatContext*,AVIOContext**,char*,int,AVDictionary**);
 *     void (*io_close)(struct AVFormatContext*,AVIOContext*);
 *     char* protocol_blacklist;
 *     int max_streams;
 *     int skip_estimate_duration_from_pts;
 *     int max_probe_packets;
 *     int (*io_close2)(struct AVFormatContext*,AVIOContext*);
 * };
 * }
 */
public class AVFormatContext {

    static final StructLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_POINTER$LAYOUT.withName("av_class"),
        Constants$root.C_POINTER$LAYOUT.withName("iformat"),
        Constants$root.C_POINTER$LAYOUT.withName("oformat"),
        Constants$root.C_POINTER$LAYOUT.withName("priv_data"),
        Constants$root.C_POINTER$LAYOUT.withName("pb"),
        Constants$root.C_LONG$LAYOUT.withName("ctx_flags"),
        Constants$root.C_LONG$LAYOUT.withName("nb_streams"),
        Constants$root.C_POINTER$LAYOUT.withName("streams"),
        Constants$root.C_POINTER$LAYOUT.withName("url"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("start_time"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("duration"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("bit_rate"),
        Constants$root.C_LONG$LAYOUT.withName("packet_size"),
        Constants$root.C_LONG$LAYOUT.withName("max_delay"),
        Constants$root.C_LONG$LAYOUT.withName("flags"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("probesize"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("max_analyze_duration"),
        Constants$root.C_POINTER$LAYOUT.withName("key"),
        Constants$root.C_LONG$LAYOUT.withName("keylen"),
        Constants$root.C_LONG$LAYOUT.withName("nb_programs"),
        Constants$root.C_POINTER$LAYOUT.withName("programs"),
        Constants$root.C_LONG$LAYOUT.withName("video_codec_id"),
        Constants$root.C_LONG$LAYOUT.withName("audio_codec_id"),
        Constants$root.C_LONG$LAYOUT.withName("subtitle_codec_id"),
        Constants$root.C_LONG$LAYOUT.withName("max_index_size"),
        Constants$root.C_LONG$LAYOUT.withName("max_picture_buffer"),
        Constants$root.C_LONG$LAYOUT.withName("nb_chapters"),
        Constants$root.C_POINTER$LAYOUT.withName("chapters"),
        Constants$root.C_POINTER$LAYOUT.withName("metadata"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("start_time_realtime"),
        Constants$root.C_LONG$LAYOUT.withName("fps_probe_size"),
        Constants$root.C_LONG$LAYOUT.withName("error_recognition"),
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("callback"),
            Constants$root.C_POINTER$LAYOUT.withName("opaque")
        ).withName("interrupt_callback"),
        Constants$root.C_LONG$LAYOUT.withName("debug"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("max_interleave_delta"),
        Constants$root.C_LONG$LAYOUT.withName("strict_std_compliance"),
        Constants$root.C_LONG$LAYOUT.withName("event_flags"),
        Constants$root.C_LONG$LAYOUT.withName("max_ts_probe"),
        Constants$root.C_LONG$LAYOUT.withName("avoid_negative_ts"),
        Constants$root.C_LONG$LAYOUT.withName("ts_id"),
        Constants$root.C_LONG$LAYOUT.withName("audio_preload"),
        Constants$root.C_LONG$LAYOUT.withName("max_chunk_duration"),
        Constants$root.C_LONG$LAYOUT.withName("max_chunk_size"),
        Constants$root.C_LONG$LAYOUT.withName("use_wallclock_as_timestamps"),
        Constants$root.C_LONG$LAYOUT.withName("avio_flags"),
        Constants$root.C_LONG$LAYOUT.withName("duration_estimation_method"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("skip_initial_bytes"),
        Constants$root.C_LONG$LAYOUT.withName("correct_ts_overflow"),
        Constants$root.C_LONG$LAYOUT.withName("seek2any"),
        Constants$root.C_LONG$LAYOUT.withName("flush_packets"),
        Constants$root.C_LONG$LAYOUT.withName("probe_score"),
        Constants$root.C_LONG$LAYOUT.withName("format_probesize"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("codec_whitelist"),
        Constants$root.C_POINTER$LAYOUT.withName("format_whitelist"),
        Constants$root.C_LONG$LAYOUT.withName("io_repositioned"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("video_codec"),
        Constants$root.C_POINTER$LAYOUT.withName("audio_codec"),
        Constants$root.C_POINTER$LAYOUT.withName("subtitle_codec"),
        Constants$root.C_POINTER$LAYOUT.withName("data_codec"),
        Constants$root.C_LONG$LAYOUT.withName("metadata_header_padding"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("opaque"),
        Constants$root.C_POINTER$LAYOUT.withName("control_message_cb"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("output_ts_offset"),
        Constants$root.C_POINTER$LAYOUT.withName("dump_separator"),
        Constants$root.C_LONG$LAYOUT.withName("data_codec_id"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("protocol_whitelist"),
        Constants$root.C_POINTER$LAYOUT.withName("io_open"),
        Constants$root.C_POINTER$LAYOUT.withName("io_close"),
        Constants$root.C_POINTER$LAYOUT.withName("protocol_blacklist"),
        Constants$root.C_LONG$LAYOUT.withName("max_streams"),
        Constants$root.C_LONG$LAYOUT.withName("skip_estimate_duration_from_pts"),
        Constants$root.C_LONG$LAYOUT.withName("max_probe_packets"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("io_close2")
    ).withName("AVFormatContext");
    public static MemoryLayout $LAYOUT() {
        return AVFormatContext.$struct$LAYOUT;
    }
    static final VarHandle av_class$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("av_class"));
    public static VarHandle av_class$VH() {
        return AVFormatContext.av_class$VH;
    }
    /**
     * Getter for field:
     * {@snippet :
     * const AVClass* av_class;
     * }
     */
    public static MemorySegment av_class$get(MemorySegment seg) {
        return (java.lang.foreign.MemorySegment)AVFormatContext.av_class$VH.get(seg);
    }
    /**
     * Setter for field:
     * {@snippet :
     * const AVClass* av_class;
     * }
     */
    public static void av_class$set(MemorySegment seg, MemorySegment x) {
        AVFormatContext.av_class$VH.set(seg, x);
    }
