// Generated by jextract

package com.icuxika.jextract.libffmpeg;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
/**
 * {@snippet :
 * struct AVFrame {
 *     uint8_t* data[8];
 *     int linesize[8];
 *     uint8_t** extended_data;
 *     int width;
 *     int height;
 *     int nb_samples;
 *     int format;
 *     int key_frame;
 *     enum AVPictureType pict_type;
 *     AVRational sample_aspect_ratio;
 *     int64_t pts;
 *     int64_t pkt_dts;
 *     AVRational time_base;
 *     int coded_picture_number;
 *     int display_picture_number;
 *     int quality;
 *     void* opaque;
 *     int repeat_pict;
 *     int interlaced_frame;
 *     int top_field_first;
 *     int palette_has_changed;
 *     int64_t reordered_opaque;
 *     int sample_rate;
 *     uint64_t channel_layout;
 *     AVBufferRef* buf[8];
 *     AVBufferRef** extended_buf;
 *     int nb_extended_buf;
 *     AVFrameSideData** side_data;
 *     int nb_side_data;
 *     int flags;
 *     enum AVColorRange color_range;
 *     enum AVColorPrimaries color_primaries;
 *     enum AVColorTransferCharacteristic color_trc;
 *     enum AVColorSpace colorspace;
 *     enum AVChromaLocation chroma_location;
 *     int64_t best_effort_timestamp;
 *     int64_t pkt_pos;
 *     int64_t pkt_duration;
 *     AVDictionary* metadata;
 *     int decode_error_flags;
 *     int channels;
 *     int pkt_size;
 *     AVBufferRef* hw_frames_ctx;
 *     AVBufferRef* opaque_ref;
 *     size_t crop_top;
 *     size_t crop_bottom;
 *     size_t crop_left;
 *     size_t crop_right;
 *     AVBufferRef* private_ref;
 *     AVChannelLayout ch_layout;
 *     int64_t duration;
 * };
 * }
 */
public class AVFrame {

    static final StructLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(8, Constants$root.C_POINTER$LAYOUT).withName("data"),
        MemoryLayout.sequenceLayout(8, Constants$root.C_LONG$LAYOUT).withName("linesize"),
        Constants$root.C_POINTER$LAYOUT.withName("extended_data"),
        Constants$root.C_LONG$LAYOUT.withName("width"),
        Constants$root.C_LONG$LAYOUT.withName("height"),
        Constants$root.C_LONG$LAYOUT.withName("nb_samples"),
        Constants$root.C_LONG$LAYOUT.withName("format"),
        Constants$root.C_LONG$LAYOUT.withName("key_frame"),
        Constants$root.C_LONG$LAYOUT.withName("pict_type"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("num"),
            Constants$root.C_LONG$LAYOUT.withName("den")
        ).withName("sample_aspect_ratio"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("pts"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("pkt_dts"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("num"),
            Constants$root.C_LONG$LAYOUT.withName("den")
        ).withName("time_base"),
        Constants$root.C_LONG$LAYOUT.withName("coded_picture_number"),
        Constants$root.C_LONG$LAYOUT.withName("display_picture_number"),
        Constants$root.C_LONG$LAYOUT.withName("quality"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("opaque"),
        Constants$root.C_LONG$LAYOUT.withName("repeat_pict"),
        Constants$root.C_LONG$LAYOUT.withName("interlaced_frame"),
        Constants$root.C_LONG$LAYOUT.withName("top_field_first"),
        Constants$root.C_LONG$LAYOUT.withName("palette_has_changed"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("reordered_opaque"),
        Constants$root.C_LONG$LAYOUT.withName("sample_rate"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("channel_layout"),
        MemoryLayout.sequenceLayout(8, Constants$root.C_POINTER$LAYOUT).withName("buf"),
        Constants$root.C_POINTER$LAYOUT.withName("extended_buf"),
        Constants$root.C_LONG$LAYOUT.withName("nb_extended_buf"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("side_data"),
        Constants$root.C_LONG$LAYOUT.withName("nb_side_data"),
        Constants$root.C_LONG$LAYOUT.withName("flags"),
        Constants$root.C_LONG$LAYOUT.withName("color_range"),
        Constants$root.C_LONG$LAYOUT.withName("color_primaries"),
        Constants$root.C_LONG$LAYOUT.withName("color_trc"),
        Constants$root.C_LONG$LAYOUT.withName("colorspace"),
        Constants$root.C_LONG$LAYOUT.withName("chroma_location"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("best_effort_timestamp"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("pkt_pos"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("pkt_duration"),
        Constants$root.C_POINTER$LAYOUT.withName("metadata"),
        Constants$root.C_LONG$LAYOUT.withName("decode_error_flags"),
        Constants$root.C_LONG$LAYOUT.withName("channels"),
        Constants$root.C_LONG$LAYOUT.withName("pkt_size"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("hw_frames_ctx"),
        Constants$root.C_POINTER$LAYOUT.withName("opaque_ref"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("crop_top"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("crop_bottom"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("crop_left"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("crop_right"),
        Constants$root.C_POINTER$LAYOUT.withName("private_ref"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("order"),
            Constants$root.C_LONG$LAYOUT.withName("nb_channels"),
            MemoryLayout.unionLayout(
                Constants$root.C_LONG_LONG$LAYOUT.withName("mask"),
                Constants$root.C_POINTER$LAYOUT.withName("map")
            ).withName("u"),
            Constants$root.C_POINTER$LAYOUT.withName("opaque")
        ).withName("ch_layout"),
